from sys import stdin
import copy


class Matrix:
    def __init__(self, m):
        self.list = copy.deepcopy(m)

    def __str__(self):
        rez = str()
        for i in self.list:
            for j in i:
                rez = rez + str(j) + "\t"
            rez = rez.strip() + "\n"
        rez = rez.strip()
        return rez

    def size(self):
        return len(self.list), len(self.list[0])


exec(stdin.read())


# Реализуйте класс Matrix. Он должен содержать:
#
#     Конструктор от списка списков. Гарантируется, что списки состоят из чисел,
# не пусты и все имеют одинаковый размер. Конструктор должен копировать содержимое
# списка списков, т. е. при изменении списков, от которых была сконструирована
# матрица, содержимое матрицы изменяться не должно.
#
#     Метод __str__, переводящий матрицу в строку. При этом элементы внутри одной
# строки должны быть разделены знаками табуляции, а строки — переносами строк.
# После каждой строки не должно быть символа табуляции и в конце не должно быть переноса строки.
#
#     Метод size без аргументов, возвращающий кортеж вида (число строк, число столбцов).
# Пример теста с участием этого метода есть в следующей задаче этой недели.