n = int(input())
print(2**n)


# Вводится целое неотрицательное число N (N≤100).
#
# Формат вывода
#
# Выведите 2ᴺ.